---
kind: method
id: M:Autodesk.Revit.DB.CustomFieldData.GetCustomFieldId
source: html/581bbb81-464e-3a69-3d31-49d1891199c7.htm
---
# Autodesk.Revit.DB.CustomFieldData.GetCustomFieldId Method

Gets an unique identifier of the custom field.

## Syntax (C#)
```csharp
public Guid GetCustomFieldId()
```

## Returns
Returns an unique identifier of type of custom field.